app/controllers/api/v1/assets_controller.rb

  def create
    user = User.find(request.session['user_id'])
    @asset = user.assets.build(asset_params)

    # Automatically set inventoried to true and inventoried_at to the current time
    @asset.inventoried = true
    @asset.inventoried_at = Time.current

    if @asset.save
---
INSERT INTO "assets" ("name", "description", "category", "created_at", "updated_at", "status", "acquisition_date", "location", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @asset = Asset.find(params[:id])

    if @asset.destroy
---
SELECT "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "assets" WHERE "assets"."id" = ?  [["id", 1]]

  def update
    @asset = Asset.find(params[:id])
    updated_params = asset_params

    # Update timestamps only if they are currently nil and the task is marked as true
    updated_params[:inventoried_at] = Time.current if updated_params[:inventoried] == true && @asset.inventoried_at.nil?
    updated_params[:valued_at] = Time.current if updated_params[:valued] == true && @asset.valued_at.nil?
    updated_params[:marshalled_at] = Time.current if updated_params[:marshalled] == true && @asset.marshalled_at.nil?
    updated_params[:administered_at] = Time.current if updated_params[:administered] == true && @asset.administered_at.nil?

    if @asset.update(updated_params)
---
SELECT "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "assets" SET "description" = ?, "updated_at" = ? WHERE "assets"."id" = ?  [["description", "This is a sample asset linked to Dan Shank and Nick."], ["updated_at", "2024-11-03 23:32:44.428905"], ["id", 4]]