app/controllers/api/v1/debts_controller.rb

INSERT INTO "debts" ("name", "amount_outstanding", "amount_paid", "category", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    user = User.find(request.session['user_id']) # Authenticate user from session
    @debt = user.debts.build(debt_params)

    if @debt.save