app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "first_name", "last_name", "phone_number", "password") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
  def sign_in
    @user = User.find_by(email: params[:email])