app/views/assets/index.html.erb

              <%= form.label :category, "Category" %>
              <%= form.select :category, Asset::CATEGORIES, { prompt: "Select a Category" }, class: "form-control" %>
---
SELECT "assets".* FROM "assets"