app/controllers/assets_controller.rb

  def index
    @assets = Asset.all
---
SELECT "assets".* FROM "assets"